---
title: FabricationConfigurationInfo
classe: Autodesk.Revit.DB.FabricationConfigurationInfo
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 15
---

# FabricationConfigurationInfo

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CloudId { get; }` | `fabricationConfigurationInfo.CloudId` | String |
| `String Description { get; }` | `fabricationConfigurationInfo.Description` | String |
| `Guid GUID { get; }` | `fabricationConfigurationInfo.GUID` | Guid |
| `Boolean IsCloudConfiguration { get; }` | `fabricationConfigurationInfo.IsCloudConfiguration` | Boolean |
| `Boolean IsLocked { get; }` | `fabricationConfigurationInfo.IsLocked` | Boolean |
| `Boolean IsValidObject { get; }` | `fabricationConfigurationInfo.IsValidObject` | Boolean |
| `String Name { get; }` | `fabricationConfigurationInfo.Name` | String |
| `String Path { get; }` | `fabricationConfigurationInfo.Path` | String |
| `UnitSystem UnitSystem { get; }` | `fabricationConfigurationInfo.UnitSystem` | UnitSystem |
| `Double Version { get; }` | `fabricationConfigurationInfo.Version` | Double |
| `Void Dispose()` | `fabricationConfigurationInfo.Dispose()` | Void |
| `FabricationConfigurationInfo FindSourceFabricationConfiguration(FabricationConfigurationInfo)` | `FabricationConfigurationInfo.FindSourceFabricationConfiguration(fabricationConfiguration)` | FabricationConfigurationInfo |
| `IList<FabricationConfigurationInfo> GetAllFabricationConfigurations()` | `FabricationConfigurationInfo.GetAllFabricationConfigurations()` | IList<FabricationConfigurationInfo> |
| `IList<String> GetProfiles()` | `fabricationConfigurationInfo.GetProfiles()` | IList<String> |
| `Boolean IsValid()` | `fabricationConfigurationInfo.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```